export const zhCN = {
  site: {
    title: "朋友船统一身份认证",
  },
  route: {
    home: "主页",
    user: {
      info: "用户信息",
    },
    oauth: {
      manage: "授权管理",
    },
  },
  setting: {
    changeLocale: "切换到中文（简体）",
  },
  code: {
    20000: "成功",
    40000: "请求有误",
    40001: "参数错误",
    40002: "参数检查不通过",
    40100: "未授权",
    40101: "token不存在",
    40102: "token校验出错",
    40103: "token已过期",
    42200: "无法处理",
    42201: "用户不存在",
    42202: "用户名已存在",
    42203: "密码错误",
    42204: "邮箱不存在",
    42205: "邮箱已经注册",
    42206: "邮箱验证码错误",
    42207: "操作频繁",
    42208: "参数不存在",
    42209: "参数已存在",
    42210: "参数不匹配",
    50000: "服务器错误",
  },
};
